clrs = ["красного", "желтого","оранжевого","зеленого","синего","фиолетового"]
clrs2 = ["красный", "желтый","оранжевый","зеленый","синий","фиолетовый"]
clrs3 = ["красных", "желтых","оранжевых","зеленых","синих","фиолетовых"]
num9 = ["0","1","2","3","4","5","6","7","8","9"]
num510 = ["5","6","7","8","9","10"]
num6 = ["0","1","2","3","4","5","6"]
num3 = ["2","3","4","5"]
num24 = ["2","3","4"]
ml = ["больше","меньше"]
maxmin = ["макс.","мин."]
acct = ["сумму","произведение"]
acct2 = ["суммой","произведением"]

x =""
str1 = f'"Сколько клеток {x} цвета на поле?",'
str2 = f'"Самое большое число на клетке {x} цвета?",'
str1 = f'"Какой цвет наиболее часто встречается под числом {0-9} ?",'
str1 = f'"Какое число наиболее часто встречается на клетка {x} цвета ?",'
str1 = f'"Сколько клеток с числом {0-9} ?",'
str1 = f'"Сколько чисел {0-9} на клетках {x} цвета ?",'

str2 = f'"Сколько клеток {x} цвета, с числами {x} {x} ?",'
str2 = f'"На клетках какого цветa {x} всего цифр {0-6} ?",'
str2 = f'"На скольки карточках есть {x} и {x} цвет одновременно?",'
str2 = f'"Сколько чисел на клетках {x} цвета больше, чем на самое большое число на клетке {x} цвета?",'
str2 = f'"Найти {maxmin}  {acct} двух чисел на {clrs2} клетках ?",'


str3 = f'"Сколько карточек с клеткой {clrs} цвета, сумма чисел на которой которых {ml} {num510}?",'
str3 = f'"Сумма на всех {clrs3} клетках ?",'
str3 = f'"Сумма на {num24} самых больших клеток {clrs} цвета ?",'
str3 = f'"Найти {maxmin} сумму на {num24} клетках разных цветов ?",'
str3 = f'"Найди карточку с {maxmin} {acct2} ?",'
str3 = f'"Найди цвет с {maxmin} {acct2} ?",'
str3 = f'"Найди карточку с {maxmin} {acct2} ?",'



for x in maxmin:
        for xx in acct2:
            print( f'"Найди цвет с {x} {xx} ?",')

exit(0)


for x in num24:
        for xx in clrs:
            print(f'"Сумма {x} самых больших клеток {xx} цвета ?",')

exit(0)


for x in clrs3:
    print( f'"Сумма на всех {x} клетках ?",')

print()
exit(0)

for x in clrs:
    for xx in ml:
        for xxx in num510:
            print(f'"Сколько карточек с клеткой {x} цвета, сумма чисел на которой которых {xx} {xxx}?",')


print()
exit(0)



for x in clrs:
        for xx in clrs:
            if x != xx:
                print( f'"Сколько клеток {x} цвета больше самой большой клетки {xx} цвета?",')


print()

for xx in num6:
        for xxx in ml:
            print(f'"На клетках какого цветa {xxx} всего цифр {xx} ?",')


print()

for xx in num3:
    for x in clrs:
        for xxx in ml:
            print(f'"Сколько клеток {x} цвета, с числами {xxx} {xx} ?",')


print()

for x in num9:
    print(f'"Сколько клеток с числом {x} ?",')

print()
for x in clrs:
    print(f'"Какое число наиболее часто встречается на клетка {x} цвета ?",')

